app/controllers/bookmarks_controller.rb

SELECT SQL_NO_CACHE * FROM `groups` WHERE (`groups`.`id` = 2)
---
  def find_group
    @group = Group.find(params[:group_id])