app/controllers/categories_controller.rb

  def show

    @categories = Category.find(:all)
    @group = Group.find(params[:id])
    @category = Category.find(params[:category_id])

    cond = Caboose::EZ::Condition.new
    cond.category_id  == @category.id
    cond.group_id  == @group.id
    order = (params[:popular] ? "view_count #{params[:popular]}": "published_at DESC")

    @posts = Post.find :all, :page => {:current => params[:page]}, :order => order, :conditions => cond.to_sql, :include => :tags


    @popular_posts = @category.posts.find(:all, :limit => 10, :order => "view_count DESC")
    @popular_polls = Poll.find_popular_in_category(@category)

    @rss_title = "#{AppConfig.community_name}: #{@category.name} "+:posts.l
    @rss_url = formatted_category_path(@category, :rss)

    @active_users = User.find(:all,
      :include => :posts,
      :limit => 5,
      :conditions => ["posts.category_id = ? AND posts.published_at > ?", @category.id, 14.days.ago],
      :order => "users.view_count DESC"
      )
---
SELECT SQL_NO_CACHE * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT SQL_NO_CACHE * FROM `groups` WHERE (`groups`.`id` = 3)
SELECT SQL_NO_CACHE * FROM `posts` WHERE (`posts`.category_id = 1) AND (published_as = 'live') ORDER BY view_count DESC, published_at desc LIMIT 10
SELECT SQL_NO_CACHE DISTINCT `users`.id FROM `users` LEFT OUTER JOIN `posts` ON posts.user_id = users.id WHERE (posts.category_id = 1 AND posts.published_at > '2009-04-06 06:30:35') ORDER BY users.view_count DESC LIMIT 5