app/controllers/groups_controller.rb

SELECT SQL_NO_CACHE `groups`.id FROM `groups` INNER JOIN memberships ON groups.id = memberships.group_id WHERE (`groups`.`id` = 2) AND ((`memberships`.user_id = 3) AND ((accepted_at IS NOT NULL))) LIMIT 1
---
  def find_group
    @group = Group.find(params[:id],:include => [:asset])