app/controllers/wikis_controller.rb

SELECT SQL_NO_CACHE * FROM `wiki_pages` WHERE (`wiki_pages`.`title` = 'Wiki') AND (`wiki_pages`.wiki_id = 996332877) ORDER BY title LIMIT 1
---
  def page
    page_title = params[:page]
    @page = @wiki.find_or_new_page(page_title)

SELECT SQL_NO_CACHE * FROM `groups` WHERE (`groups`.`id` = 2)
---
  def find_wiki
    @section = 'wiki'
    @group = Group.find(params[:group_id])